app/controllers/candidate_controller.rb

  def index
    render json: Candidate.all
---
SELECT "candidates".* FROM "candidates"

  def show
    id = params["id"]
    render json: Candidate.first
---
SELECT  "candidates".* FROM "candidates"  ORDER BY "candidates"."id" ASC LIMIT 1