app/controllers/vote_controller.rb

  def index
    render json: Vote.all
---
SELECT "votes".* FROM "votes"

  def show
    id = params["id"]
    render json: Vote.first
---
SELECT  "votes".* FROM "votes"  ORDER BY "votes"."id" ASC LIMIT 1