app/controllers/voter_controller.rb

  def index
    render json: Voter.all
---
SELECT "voters".* FROM "voters"

  def show
    if params["token"] == true
      token = params["token"]
      render json: Voter.first
---
SELECT  "voters".* FROM "voters"  ORDER BY "voters"."id" ASC LIMIT 1